app/controllers/criancas_controller.rb

  def index
    @criancas = Crianca.find(:all)
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def search
    @crianca = Crianca.find(:all, :conditions => ["nome like ?", "%" + params[:search].to_s + "%"], :include => ['grupo','unidade'])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC
SELECT * FROM `grupos` WHERE (`grupos`.`id` IN (1,2,3,4,5))
SELECT * FROM `unidades` WHERE (`unidades`.`id` IN (7,25,26,40,2,32))

  def show
    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def edit

    @crianca = Crianca.find(params[:id])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def atualiza_grupo
    @atualiza_grupo = Crianca.find(:all)
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def un_op1_din
    #@criancas = Crianca.un_din
    $consulta = 1
    $unidade_op1_id = params[:unidade_unidade_op1_id]

    @crianca = Crianca.find(:all, :conditions => ["option1 = "+ $unidade_op1_id + " and matricula != 1"], :order =>("servidor_publico desc, transferencia desc, created_at"))
    if @crianca.nil? or @crianca.empty? then
---
SELECT * FROM `criancas` WHERE (option1 = 15 and matricula != 1) ORDER BY servidor_publico desc, transferencia desc, created_at
SELECT * FROM `criancas` ORDER BY nome ASC

  def mat_unidade
    $consulta = 2
    $unidade = params[:unidade_unidade_mat_id]
    @crianca = Crianca.find(:all, :conditions => ["unidade_matricula =" + $unidade + " and matricula =1"], :order => "created_at")
    if @crianca.nil? or @crianca.empty? then
---
SELECT * FROM `criancas` WHERE (unidade_matricula =52 and matricula =1) ORDER BY created_at
SELECT * FROM `criancas` ORDER BY nome ASC

  def nome_crianca
    $consulta = 6
    $crianca = params[:crianca_crianca_id]
    @crianca = Crianca.find(:all, :conditions => ['id=' + $crianca ])
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def load_grupos
    @grupos =  Grupo.find(:all, :order => "nome")
---
SELECT * FROM `grupos` WHERE (`grupos`.`id` = 6)

  def load_regiaos
    @regiaos =  Regiao.find(:all, :order => "nome")
---
SELECT * FROM `regiaos` WHERE (`regiaos`.`id` = 1) LIMIT 1

  def load_unidades
    @unidades =  Unidade.find(:all, :order => "nome")
---
SELECT * FROM `unidades` WHERE (`unidades`.`id` = 15) LIMIT 1

  def load_criancas
    @criancas = Crianca.find(:all, :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (matricula = 0) ORDER BY nome ASC

  def load_criancas_mat
    @criancasmat = Crianca.find(:all, :conditions => ["matricula = 0" ], :order => "nome ASC")
---
SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)