app/controllers/grafico_controller.rb

  def grafico_demanda_geral
    @graph = open_flash_chart_object(600,300,"/grafico/graph_code_demanda_geral")

        @static_graph = Gchart.pie(
          :data => [(Crianca.b_u).length,(Crianca.b_dm).length],
          :title => "Demanda Geral - Crianças Cadastradas: #{Crianca.c.length}",
          :size => '600x300',
          :labels => ["Matriculadas #{(Crianca.b_u).length}", "Não matriculadas #{(Crianca.b_dm).length}"])
---
SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)

  def search
      input = params[:contact][:grafico_id]
      @graph = open_flash_chart_object(600,300,"/grafico/graph_por_unidade?unidade=#{input}",false,'/')


    @static_graph = Gchart.pie(
        :data => [(Crianca.matriculas_crianca_por_unidade(input)).length,(Crianca.nao_matriculas_crianca_por_unidade(input)).length],
        :title => "Demanda por Unidade: #{Crianca.nome_unidade(input)} - #{(Crianca.todas_crianca_por_unidade(input)).length}" ,
        :size => '600x300',
        :labels => ["Matriculadas #{(Crianca.matriculas_crianca_por_unidade(input)).length}", "Não matriculadas #{(Crianca.nao_matriculas_crianca_por_unidade(input)).length}"])
---
SELECT * FROM `criancas` WHERE (option1 = '15' and matricula <> 1)
SELECT * FROM `unidades`

  def graph_code_demanda_geral
    title = Title.new("Demanda Geral - Crianças Cadastradas: #{Crianca.c.length}")
    pie = Pie.new
    pie.start_angle = 0
    pie.animate = true
    pie.tooltip = '#val# of #total#<br>#percent# of 100%'
    pie.colours = ["#d01f3c", "#356aa0", "#C79810"]
    pie.values  = [PieValue.new(Crianca.b_u.length,"Crianças Matriculadas"), PieValue.new(Crianca.b_dm.length,"Crianças Não Matriculadas")]
---
SELECT * FROM `criancas`
SELECT * FROM `criancas` WHERE (`criancas`.`matricula` = 1)

  def graph_por_unidade
    unidade = params[:unidade]
    title = Title.new("Demanda por Unidade: #{Crianca.nome_unidade(unidade)} - Criancas Cadastradas: #{Crianca.todas_crianca_por_unidade(unidade).length}" )
---
SELECT * FROM `criancas` WHERE (option1 = '2' and matricula <> 1)
SELECT * FROM `unidades`

  def load_unidades
    @unidades = Unidade.all
---
SELECT * FROM `unidades`